#+BEGIN_COMMENT
.. title: Vanilla RNNs and GRUs
.. slug: vanilla-rnns-and-grus
.. date: 2021-01-01 20:21:58 UTC-08:00
.. tags: nlp,rnns
.. category: NLP
.. link: 
.. description: Looking at Recurrent Neural Networks with and without GRUs.
.. type: text
.. has_math: True
#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-173c4e71-b516-4d1c-9dc3-75c8fef90415-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
**** A Check

#+begin_src python :results output :exports both
actual = forward_GRU([inputs.X[1], inputs.hidden_state], weights)[0]
print(actual)

expected = numpy.array([[ 9.77779014e-01],
                        [-9.97986240e-01],
                        [-5.19958083e-01],
                        [-9.99999886e-01],
                        [-9.99707004e-01],
                        [-3.02197037e-04],
                        [-9.58733503e-01],
                        [ 2.10804828e-02],
                        [ 9.77365398e-05],
                        [ 9.99833090e-01],
                        [ 1.63200940e-08],
                        [ 8.51874303e-01],
                        [ 5.21399924e-02],
                        [ 2.15495959e-02],
                        [ 9.99878828e-01],
                        [ 9.77165472e-01]])
expect(numpy.allclose(actual, expected)).to(be_true)
#+end_src

#+RESULTS:
#+begin_example
[[ 9.77779014e-01]
 [-9.97986240e-01]
 [-5.19958083e-01]
 [-9.99999886e-01]
 [-9.99707004e-01]
 [-3.02197037e-04]
 [-9.58733503e-01]
 [ 2.10804828e-02]
 [ 9.77365398e-05]
 [ 9.99833090e-01]
 [ 1.63200940e-08]
 [ 8.51874303e-01]
 [ 5.21399924e-02]
 [ 2.15495959e-02]
 [ 9.99878828e-01]
 [ 9.77165472e-01]]
#+end_example

*** Vanilla RNNs
    We'll train the RNN and also time it.

#+begin_src python :results output :exports both    
tick = perf_counter()
ys, h_T = scan(forward_vanilla_RNN, inputs.X, weights, inputs.hidden_state)
tock = perf_counter()
RNN_time=(tock-tick) * 1000
print (f"It took {RNN_time:.2f}ms to run the forward method for the vanilla RNN.")
#+end_src

#+RESULTS:
: It took 2.03ms to run the forward method for the vanilla RNN.

*** GRUs
#+begin_src python :results output :exports both
tick = perf_counter()
ys, h_T = scan(forward_GRU, inputs.X, weights, inputs.hidden_state)
tock = perf_counter()
GRU_time=(tock - tick) * 1000
print (f"It took {GRU_time:.2f}ms to run the forward method for the GRU.")
#+end_src

#+RESULTS:
: It took 5.48ms to run the forward method for the GRU.


GRUs take more time to compute. This means that training and prediction would take more time for a GRU than for a vanilla RNN. However, GRUs allow you to propagate relevant information even for long sequences, so when selecting an architecture for NLP we should assess the tradeoff between computational time and performance. 
